Repository: 84000/data-translation-memory
Catalog: Toh_207-Strength_of_the_Elephant-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་བདག་ནི་འདི་སྙམ་བགྱིད་དེ། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྟོན་པའི་བྱང་ཆུབ་སེམས་དཔས་བདག་གི་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བགྱིའོ་སྙམ་དུ་སེམས་སོ། །
en: “Blessed One, it seems to me that bodhisattvas who teach this Dharma discourse should even disregard their own body and life,”

source: འཇམ་དཔལ་དེ་དེ་བཞིན་ནོ། །
en: “So it is, Mañjuśrī,”

source: དེ་དེ་བཞིན་ཏེ། ཁྱོད་ཇི་སྐད་ཟེར་བ་དེ་བཞིན་ནོ། །
en: “It is just as you have said it is.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: Then, the Blessed One spoke to the venerable Ānanda:

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྐྱེ་བོ་མང་པོའི་དོན་བྱེད་པར་འགྱུར་གྱིས། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཟུང་ཤིག །
en: “Because this Dharma discourse will benefit many beings, Ānanda, you should remember it.

source: ཀུན་དགའ་བོ་སེམས་ཅན་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པ་དེ་དག་གླང་པོའི་རྩལ་དང་། གླང་པོ་ཆེན་པོའི་རྩལ་གྱིས་གནོན་པར་འགྱུར།
en: Ānanda, beings who yearn for this Dharma discourse will be subdued by the strength of the bull and the strength of the elephant.

source: ཀུན་དགའ་བོ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མོས་པ་དེ་དག་སེང་གེའི་འགྲོས་དང་། ཁྱུ་མཆོག་གི་འགྲོས་སུ་འགྲོ་བར་འགྱུར་རོ། །
en: Ānanda, those who arouse faith in this Dharma discourse will stride like a lion, like a bull.

source: ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རབ་ཏུ་དགའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བར་བྱེད་པར་འགྱུར་རོ། །
en: Ānanda, this Dharma discourse delights bodhisattvas and makes them appear.

source: ང་འདས་པའི་ཕྱི་ན་བྱང་ཆུབ་སེམས་དཔའི་ལག་ཏུ་འོང་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའི་གླེགས་བམ་དུ་འོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྒྲོམ་དུ་འོང་བར་འགྱུར་རོ། །
en: After I have passed away, it will come into the hands of bodhisattvas, into their scriptures and repositories.

source: བྱང་ཆུབ་སེམས་དཔའ་གདོལ་པ་རྣམས་ཀྱི་ལག་ཏུ་འོང་བར་མི་འགྱུར། གླེགས་བམ་དུ་འོང་བ་དང་། སྒྲོམ་དུ་འོང་བར་མི་འགྱུར་རོ། །
en: It will not come into the hands, scriptures, or repositories of outcast bodhisattvas.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: promised the venerable Ānanda.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་བཞིན་གཤེགས་པས་ཇི་སྐད་བཤད་པ་བཞིན་དུ་བདག་གིས་གཟུང་ངོ་། །
en: “Blessed One, I will hold this Dharma discourse in precisely the way it was explained by the Tathāgata,”

source: ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཇི་ལྟར་ཟིན་པ་བཞིན་དུ་གང་དག་ལ་བྱིན་པའི་སེམས་ཅན་དེ་དག་ལ་ཁྱོད་སྟོན་པའི་བྱ་བ་བྱེད་པ་
en: Ānanda,” “It is excellent that you will commit yourself to teaching this Dharma discourse, just as you have received it, to the beings for whom it was given.”

source: ལེགས་སོ་ལེགས་སོ། །
en: “Excellent,

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་རྣམས་ཡིད་དགའ་སྟེབཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: After the Blessed One had uttered these words, the venerable Ānanda, the venerable Śāriputra, Youthful Mañjuśrī, and the worlds of the gods, humans, demigods, and gandharvas rejoiced and praised the Blessed One’s words.

source: གླང་པོའི་རྩལ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the Great Vehicle sūtra “ The Strength of the Elephant .”
